## Привет, я веб-разработчик

- коротко обо мне:<br><br>
📍 высшее образование по направлению «Бизнес-информатика»<br>
📍 2 года опыта в интернет-маркетинге<br>
📍 4 года опыта в веб-разработке<br>
📍 интересуюсь, как фротендом, так и бэкендом<br>
📍 нравится разрабатывать сайты на CMS системе WordPress от верстки шаблона до настройки логики

### 💻 Скилы

- языки и технологии:<br><br>
![HTML](https://img.shields.io/badge/-html-orange)
![CSS](https://img.shields.io/badge/-css-green)
![SCSS](https://img.shields.io/badge/-scss-blueviolet)
![LESS](https://img.shields.io/badge/-less-blue)
![BOOTSTRAP](https://img.shields.io/badge/-bootstrap-blueviolet)<br>
![БЭМ](https://img.shields.io/badge/-bem-blue)<br>
![GULP](https://img.shields.io/badge/-gulp-red)<br>
![JS](https://img.shields.io/badge/-js-yellow)
![JQUERY](https://img.shields.io/badge/-jquery-blue)<br>
![PHP](https://img.shields.io/badge/-php-blue)
![MYSQL](https://img.shields.io/badge/-mysql-blue)<br><br>

- работа с CMS системами:<br><br>
📍 Wordpress. Натяжка сверстанных макетов на CMS. Разработка функционала сайта: создание собственной темы, вывод данных.<br>
📍 OpenCart. Правка логики плагинов, редизайн шаблона.<br>
📍 1С-Битрикс. Правка контента, верстка страниц акций, промо-страниц, редизайн шаблона.<br><br>

- инструменты:<br><br>
📍 Figma <br>
📍 Photoshop<br>
📍 Illustrator<br>
📍 Яндекс Вебмастер <br>
📍 Яндекс Метрика/Google Analytics


### 💻 Проекты, которые не стыдно показать

[Лендинг Центра сертификации](https://devssro.github.io/ros_bussines_reputation/)
- верстка лендинга по макету Figma (scss), в планах доработка адаптива
- разработка логики сохранения заявок в базу данных, отправки на почту администратора и в телеграмм-чат (php + js)
- небольшие врезки использования vue js: для интерактива переключения отзывов

![Wordpress](https://img.shields.io/badge/-wordpress-blue) [Сайт периодического электронного издания](https://srogazeta.ru/)
- участие в продумывании дизайна;
- вёрстка страниц по макетам Figma;
- разработка логики приложения;
- "натяжка" макета на worpdress, создание кастомной темы.

![Wordpress](https://img.shields.io/badge/-wordpress-blue) [Электронный справочник участников Ассоциации](https://opsr.ru/)
- разработка логики сайта
- дизайн и верстка кастомной темы
- связь фротенд- и бэкенд-части<br><br>

[Лендинг аудиокурса](https://language-efficiency.com/jane_stories/)
- верстка по макету AI (bootstrap + html/css + js)<br><br>

[Промо-лендинг](https://langme.ru/lk/promo/summer-21.php)
- верстка по макету Figma (html/scss + js/jQuery)

[Реализация выпадающего меню](http://s98172cd.beget.tech/test9/)
- верстка модуля для сайта обучения (html/less + js)

[Промо-страница со слайдерами](http://s98172cd.beget.tech/test6/)
- верстка промо-страницы для сайта обучения (html/less + js)
